In [1]:
import numpy as np 
import pandas as pd

In [2]:
route_data = pd.read_csv("known_route_repo.csv")

In [3]:
route_data.head()

               Route_ID                   timestamp   latitude  longitude
0  0_Austin_Los Angeles  2024-07-09 04:27:31.270921  30.267115 -97.743072
1  0_Austin_Los Angeles  2024-07-09 04:37:35.836141  30.274387 -97.761541
2  0_Austin_Los Angeles  2024-07-09 04:47:40.401361  30.264452 -97.786738
3  0_Austin_Los Angeles  2024-07-09 04:57:44.966581  30.236759 -97.840425
4  0_Austin_Los Angeles  2024-07-09 05:07:49.531801  30.232651 -97.876297

In [9]:
route_data["Route_ID"].nunique()

24

In [12]:
route_data["Route_ID"].unique()

array(['0_Austin_Los Angeles', '1_Austin_Los Angeles', '0_Austin_Houston',
       '1_Austin_Houston', '0_Austin_Philadelphia',
       '1_Austin_Philadelphia', '0_Austin_San Diego',
       '1_Austin_San Diego', '0_Austin_San Jose', '1_Austin_San Jose',
       '0_Austin_Jacksonville', '1_Austin_Jacksonville',
       '0_Chicago_Columbus', '1_Chicago_Columbus', '0_Chicago_Charlotte',
       '1_Chicago_Charlotte', '0_Chicago_Seattle', '1_Chicago_Seattle',
       '0_Chicago_Washington, D.C.', '1_Chicago_Washington, D.C.',
       '0_New York City_Seattle', '1_New York City_Seattle',
       '0_Portland_Atlanta', '1_Portland_Atlanta'], dtype=object)

In [21]:
route_data["timestamp"].head()

0    2024-07-09 04:27:31.270921
1    2024-07-09 04:37:35.836141
2    2024-07-09 04:47:40.401361
3    2024-07-09 04:57:44.966581
4    2024-07-09 05:07:49.531801
Name: timestamp, dtype: object

In [25]:
# Splitting 'Timestamp' into 'Date' and 'Time'
route_data['Date'] = pd.to_datetime(route_data['timestamp']).dt.date
route_data['Time'] = pd.to_datetime(route_data['timestamp']).dt.strftime('%H:%M:%S')

In [26]:

route_data[['Route_Type', 'Start_Location', 'Goal_Location']] = route_data['Route_ID'].str.split('_', n=2, expand=True)



#tools.display_dataframe_to_user(name="Route Data", dataframe=route_data)

In [27]:
route_data.head()

,Route_ID,timestamp,latitude,longitude,Route_Type,Start_Location,Goal_Location,Date,Time
0,0_Austin_Los Angeles,2024-07-09 04:27:31.270921,30.267115,-97.743072,0,Austin,Los Angeles,2024-07-09,04:27:31
1,0_Austin_Los Angeles,2024-07-09 04:37:35.836141,30.274387,-97.761541,0,Austin,Los Angeles,2024-07-09,04:37:35
2,0_Austin_Los Angeles,2024-07-09 04:47:40.401361,30.264452,-97.786738,0,Austin,Los Angeles,2024-07-09,04:47:40
3,0_Austin_Los Angeles,2024-07-09 04:57:44.966581,30.236759,-97.840425,0,Austin,Los Angeles,2024-07-09,04:57:44
4,0_Austin_Los Angeles,2024-07-09 05:07:49.531801,30.232651,-97.876297,0,Austin,Los Angeles,2024-07-09,05:07:49

In [11]:
route_data["timestamp"].nunique()

3365

In [10]:
route_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3541 entries, 0 to 3540
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Route_ID   3541 non-null   object
 1   timestamp  3541 non-null   object
 2   latitude   3541 non-null   float64
 3   longitude  3541 non-null   float64
dtypes: float64(2), object(2)
memory usage: 110.8+ KB

In [29]:
route_data.drop(columns=["timestamp"],inplace=True)

In [31]:
route_data.head(5)

,Route_ID,latitude,longitude,Route_Type,Start_Location,Goal_Location,Date,Time
0,0_Austin_Los Angeles,30.267115,-97.743072,0,Austin,Los Angeles,2024-07-09,04:27:31
1,0_Austin_Los Angeles,30.274387,-97.761541,0,Austin,Los Angeles,2024-07-09,04:37:35
2,0_Austin_Los Angeles,30.264452,-97.786738,0,Austin,Los Angeles,2024-07-09,04:47:40
3,0_Austin_Los Angeles,30.236759,-97.840425,0,Austin,Los Angeles,2024-07-09,04:57:44
4,0_Austin_Los Angeles,30.232651,-97.876297,0,Austin,Los Angeles,2024-07-09,05:07:49

In [32]:
route_data.to_csv("final_known_route_repo.csv")

In [4]:
trip_data = pd.read_csv("On-going trip data.csv")

In [5]:
trip_data.head()

  Pallet_ID                   timestamp   latitude  longitude
0     Y0623  2024-09-05 08:00:00.000000  41.795567 -87.575332
1    S21000  2024-09-05 08:10:54.110160  40.584618 -73.845570
2     A8624  2024-09-05 08:21:07.557000  41.996865 -87.829199
3    I21001  2024-09-05 08:32:42.330480  40.576574 -74.307722
4    Q11002  2024-09-05 08:43:36.440640  40.551580 -74.206959

In [7]:
trip_data["Pallet_ID"].nunique()

625

In [8]:
trip_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 851 entries, 0 to 850
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Pallet_ID  851 non-null    object
 1   timestamp  851 non-null    object
 2   latitude   851 non-null    float64
 3   longitude  851 non-null    float64
dtypes: float64(2), object(2)
memory usage: 26.7+ KB

In [33]:
trip_data['Time'] = pd.to_datetime(trip_data['timestamp']).dt.strftime('%H:%M:%S')

In [36]:
trip_data['Date'] = pd.to_datetime(trip_data['timestamp']).dt.date

In [37]:
trip_data.head()

,Pallet_ID,timestamp,latitude,longitude,Time,Date
0,Y0623,2024-09-05 08:00:00.000000,41.795567,-87.575332,08:00:00,2024-09-05
1,S21000,2024-09-05 08:10:54.110160,40.584618,-73.845570,08:10:54,2024-09-05
2,A8624,2024-09-05 08:21:07.557000,41.996865,-87.829199,08:21:07,2024-09-05
3,I21001,2024-09-05 08:32:42.330480,40.576574,-74.307722,08:32:42,2024-09-05
4,Q11002,2024-09-05 08:43:36.440640,40.551580,-74.206959,08:43:36,2024-09-05

In [38]:
trip_data.drop(columns=["timestamp"],inplace=True)

In [39]:
trip_data.head(5)

  Pallet_ID   latitude  longitude      Time        Date
0     Y0623  41.795567 -87.575332  08:00:00  2024-09-05
1    S21000  40.584618 -73.845570  08:10:54  2024-09-05
2     A8624  41.996865 -87.829199  08:21:07  2024-09-05
3    I21001  40.576574 -74.307722  08:32:42  2024-09-05
4    Q11002  40.551580 -74.206959  08:43:36  2024-09-05

In [40]:
trip_data.to_csv("final_on_going_trip_data.csv")

In [44]:
route_data["Start_Location"].unique()

array(['Austin', 'Chicago', 'New York City', 'Portland'], dtype=object)

In [45]:
route_data["Goal_Location"].unique()

array(['Los Angeles', 'Houston', 'Philadelphia', 'San Diego', 'San Jose',
       'Jacksonville', 'Columbus', 'Charlotte', 'Seattle',
       'Washington, D.C.', 'Atlanta'], dtype=object)

In [46]:
route_data.columns

Index(['Route_ID', 'latitude', 'longitude', 'Route_Type', 'Start_Location',
       'Goal_Location', 'Date', 'Time'],
      dtype='object')

In [47]:
trip_data.columns

Index(['Pallet_ID', 'latitude', 'longitude', 'Time', 'Date'], dtype='object')

In [ ]:
--